// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
namespace Zadacha23
{
   class Zadacha
    {
         static void Main(string[] args)
        {
          Console.WriteLine("Введите координаты первой точки");
          
         Console.ReadKey();
         }
     }  
}   
