// Задайте двумерный массив размером m×n, заполненный случайными вещественными числами.
namespace Zadacha47
{
   class Zadachi
    {
         static void Main(string[] args)
        {
             Console.WriteLine("Введите количество чисел, которое хотите ввести: ");
             
         }
     }  
}   
