// Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
namespace Zadacha27
{
   class Zadachi
    {
         static void Main(string[] args)
        {
          Console.WriteLine("Введите число: ");
          int[] array = new int [Console.ReadLine()];
         }
     }  
}   
