// Напишите программу, которая принимает на вход координаты двух точек 
// и находит расстояние между ними в 3D пространстве.
namespace Zadacha19
{
   class Zadachi
    {
         static void Main(string[] args)
        {
          Console.WriteLine("Введите координаты первой точки");
          int x1 = Convert.ToInt32(Console.ReadLine());
          int y1 = Convert.ToInt32(Console.ReadLine());
          int z1 = Convert.ToInt32(Console.ReadLine());
         Console.ReadKey();
         }
     }  
}   
